-- insert item

-- Создаём перечень вещей которые клиенты смогут взять в аренду.

INSERT INTO item (
    name,
    description
)
VALUES 
    ('Дрель-шуруповерт MAKITA DF0300', 'Описание
Дрель MAKITA DF0300 320Вт,БЗП-10мм,0-450\0-1500об\м,1.2кг,кор

Дрель Makita DF0300 применяется для закручивания крепежа и сверления отверстий. Имеет два режима работы: высокоскоростной режим и режим с пониженной скоростью. Двойная защитная изоляция обеспечивает безопасность в эксплуатации. Благодаря быстрозажимному патрону смена оснастки занимает минимум времени. Функция реверса облегчает извлечение заклинившего сверла из материала.

Технические характеристики:
- Ленточные (магазинные): нет;
- Max диаметр сверления (металл): 10 мм;
- Мах диаметр сверления (дерево): 28 мм;
- Тип: сетевой;
- Наличие удара: нет;
- Наличие подсветки: нет;
- Размер зажимаемой оснастки: 1-10 мм;
- Тип патрона: быстрозажимной;
- Число скоростей: 2;
- Вес: 1,2 кг;
- Габариты: 220х67х206 мм;
- Max крутящий момент: 56 Нм;
- Регулировка частоты вращения: есть;
- Мощность: 320 Вт;
- Наличие реверса: есть;
- Частота вращения шпинделя: 0-450 / 0-1500 об/мин;
- Жесткий вращающий момент: 56 Нм;

Особенности:
- Электронная регулировка числа оборотов;
- Механическая двухступенчатая передача;
- Реверс для изменения направления вращения;
- Обрезиненная рукоять для надежного захвата Makita DF0300;
- Высокоскоростной режим для быстрого сверления и заворачивания;
- Режим пониженной скорости для тяжелых условий эксплуатации, требующих высокого крутящего момента и пониженных оборотов.

Комплектация:
- Дрель;
- Бита;
- Коробка;

Габариты и вес:
- Вес: 1,72 кг;
- Длина: 255 мм;
- Ширина: 90 мм;
- Высота: 290 мм.'),

    ('Дрель-шуруповерт HAMMER DRL420A', 'Сетевая дрель-шуруповерт Hammer Flex DRL420А подходит для работы с крепежом, сверления без удара в дереве, металле, кафеле и т.д. Мощность дрели – 300 Вт. Максимальные обороты - 1450 об/мин. Диаметр патрона 10 мм.

Особенности модели:
Двухскоростной редуктор позволяет не только сверлить, но и работать с крепежом.
Открытый доступ к коллекторному узлу для простоты замены щеток.
23 ступени крутящего момента позволяют подобрать оптимальный режим работы для материала любой плотности и крепежа различных диаметров.
Электронная регулировка оборотов предотвращает заклинивание инструмента при высверливании отверстий в твердых материалах.
Фиксатор выключателя облегчает длительную работу с дрелью. Вам не придется постоянно зажимать кнопку включения.
Эргономичная форма рукоятки и прорезиненные вставки на ней обеспечивают удобный хват и не дают дрели выскользнуть из ладони.
Быстрозажимной патрон для простой замены оснастки. Для этого не нужен вспомогательный инструмент.
Компактные размеры и вес всего 1,66 кг значительно упрощают работу с дрелью.
Комплектация:
Дрель
Инструкция
Коробка'),

    ('Бензопила HUSQVARNA 120 Mark II 16''', 'Описание
Бензопила HUSQVARNA 120 Mark II 16 используется для валки деревьев, заготовки дров, распила бруса, веток и досок. Пригодится в саду, на даче или строительной площадке.

Особенности модели
Технология X-Torq

Система позволяет сократить расходы топлива и уменьшает вибрацию. Предотвращает риск возникновения синдрома белых пальцев.  

Функция Air Injection 

Опилки отбрасываются в сторону и не попадают во внутренние узлы бензопилы. Воздушный фильтр меньше засоряется, его нужно реже чистить или менять.  

Система LowVib 

Функция снижает вибрации при работе с бензопилой. Стальные пружины (демпферы) между рукоятками уменьшают отдачу.

Блокировка включения

Перед запуском необходимо зажать кнопку блокировки и пуска одновременно. Повышает безопасность использования.

Праймер 

Праймер подкачивает топливо в карбюратор. Упрощает запуск сухого двигателя.

Инерционный тормоз цепи 

Вращение цепи мгновенно прекращается при нажатии на щиток. Предотвращает травмы при обратном ударе.

Объём бака – 300 мл 

На полной заправке пила проработает без перерывов до 40 минут.

Зубчатый упор 

Упор облегчает работу и контроль над инструментом. Прижмите его к дереву, чтобы не удерживать пилу на весу при валке или распиле ствола.

Эргономичные рукоятки 

Передняя рукоятка повышает удобство маневрирования пилой. Благодаря рифлёному покрытию инструмент не скользит в голых ладонях или перчатках.

Комплектация:
Цепная пила
Шина 16 "
Цепь 3/8″
Инструкция 
Упаковка 
Советы по использованию:
Не обрезайте сучья концом пилы. Это увеличивает риск заклинивания пилы и обратного удара. 
Смешивайте топливо из бензина и масла в соотношении 50:1. Используйте бензин с октановым числом не менее АИ-92 и оригинальные масла HUSQVARNA.
Бензопила HUSQVARNA 120 Mark II 16 предназначена для работ в саду, парке, сквере или на даче. Экономно расходует топливо и запустится даже после долгого простоя. Годится для распила деревьев и строительных материалов.'),

    ('Вентилятор напольный ZANUSSI ZFF-705', 'Описание
Вентилятор Zanussi ZFF-705 напольный

Вентиляторы ZFF-705 создают эффект свежего ветра в помещении и ускоряют циркуляцию воздуха. Прибор обладает пониженным уровнем шума, его работа не будет отвлекать вас от дел. Перемещать вентилятор удобно благодаря предусмотренной на корпусе зоне ANTI-SLIP.
Отличительные особенности:
Пониженный уровень шума работы вентилятора
Высокоустойчивое основание «Circle heavy» исключает возможность опрокидывания прибора.
Усиленная защитная решетка с двойными ребрами жесткости.
Высота вентилятора комфортно регулируется до 1,32 м с помощью телескопической ножки
Интуитивно понятная панель управления
Ultra-современный дизайн

Количество режимов работы 1
Вес товара (нетто) 4.5 кг
Количество скоростей 3

Комплектация:
Вентилятор
Руководство по эксплуатации
Упаковка'),

    ('Вентилятор напольный ZANUSSI ZFF-705', 'Описание
Вентилятор Zanussi ZFF-705 напольный

Вентиляторы ZFF-705 создают эффект свежего ветра в помещении и ускоряют циркуляцию воздуха. Прибор обладает пониженным уровнем шума, его работа не будет отвлекать вас от дел. Перемещать вентилятор удобно благодаря предусмотренной на корпусе зоне ANTI-SLIP.
Отличительные особенности:
Пониженный уровень шума работы вентилятора
Высокоустойчивое основание «Circle heavy» исключает возможность опрокидывания прибора.
Усиленная защитная решетка с двойными ребрами жесткости.
Высота вентилятора комфортно регулируется до 1,32 м с помощью телескопической ножки
Интуитивно понятная панель управления
Ultra-современный дизайн

Количество режимов работы 1
Вес товара (нетто) 4.5 кг
Количество скоростей 3

Комплектация:
Вентилятор
Руководство по эксплуатации
Упаковка'),

    ('Самокат Navigator чёрный', 'Самокат Navigator обладает превосходными ходовыми качествами и надежностью.'),

    ('Самокат Navigator чёрный', 'Самокат Navigator обладает превосходными ходовыми качествами и надежностью.'),

    ('Горный велосипед GT 27.5 AGGRESSOR EXPERT', 'Несмотря на грозное название, велосипеды Aggressor имеют добрый характер и позитивный нрав, чем обязательно поделятся со своими владельцами. Все обновления, пришедшие к Avalanche, коснулись и этого семейства, считающегося фундаментом всего модельного ряда маунтинбайков GT. Обновленная алюминиевая рама в двух версиях в зависимости от размера комплектующих их колес и сбалансированный набор компонентов – это GT Aggressor Expert. Самый солидный представитель семейства готов вместе с вами прокатиться в парке, принять участие в исследовании загородных окрестностях, а потом, вернувшись домой, незаметно порадоваться полученной вами порции удовольствия от прогулки, освежающему заряду бодрости и стойкому желанию повторить.'),

    ('Горный велосипед GT 27.5 AGGRESSOR EXPERT', 'Несмотря на грозное название, велосипеды Aggressor имеют добрый характер и позитивный нрав, чем обязательно поделятся со своими владельцами. Все обновления, пришедшие к Avalanche, коснулись и этого семейства, считающегося фундаментом всего модельного ряда маунтинбайков GT. Обновленная алюминиевая рама в двух версиях в зависимости от размера комплектующих их колес и сбалансированный набор компонентов – это GT Aggressor Expert. Самый солидный представитель семейства готов вместе с вами прокатиться в парке, принять участие в исследовании загородных окрестностях, а потом, вернувшись домой, незаметно порадоваться полученной вами порции удовольствия от прогулки, освежающему заряду бодрости и стойкому желанию повторить.'),
    ('Горный велосипед GT 27.5 AGGRESSOR EXPERT', 'Несмотря на грозное название, велосипеды Aggressor имеют добрый характер и позитивный нрав, чем обязательно поделятся со своими владельцами. Все обновления, пришедшие к Avalanche, коснулись и этого семейства, считающегося фундаментом всего модельного ряда маунтинбайков GT. Обновленная алюминиевая рама в двух версиях в зависимости от размера комплектующих их колес и сбалансированный набор компонентов – это GT Aggressor Expert. Самый солидный представитель семейства готов вместе с вами прокатиться в парке, принять участие в исследовании загородных окрестностях, а потом, вернувшись домой, незаметно порадоваться полученной вами порции удовольствия от прогулки, освежающему заряду бодрости и стойкому желанию повторить.');


-- insert rent_price

-- Заполняем таблицу возможных вариантов сдачи вещей в аренду.

INSERT INTO rent_price (
    item_id,
    name,
    price
)
VALUES
    (1, 'Аренда с оплатой за час.', 50),
    (1, 'Аренда с оплатой за день.', 250),
    (1, 'Аренда с оплатой за неделю.', 1250),
    (1, 'Аренда с оплатой за месяц.', 4000),

    (2, 'Аренда с оплатой за час.', 50),
    (2, 'Аренда с оплатой за день.', 250),
    (2, 'Аренда с оплатой за неделю.', 1250),
    (2, 'Аренда с оплатой за месяц.', 4000),

    (3, 'Аренда с оплатой за час.', 100),
    (3, 'Аренда с оплатой за день.', 500),
    (3, 'Аренда с оплатой за неделю.', 2500),
    (3, 'Аренда с оплатой за месяц.', 8000),

    (4, 'Аренда с оплатой за час.', 50),
    (4, 'Аренда с оплатой за день.', 250),
    (4, 'Аренда с оплатой за неделю.', 1250),
    (4, 'Аренда с оплатой за месяц.', 4000),

    (5, 'Аренда с оплатой за час.', 50),
    (5, 'Аренда с оплатой за день.', 250),
    (5, 'Аренда с оплатой за неделю.', 1250),
    (5, 'Аренда с оплатой за месяц.', 4000),

    (6, 'Аренда с оплатой за час.', 50),
    (6, 'Аренда с оплатой за день.', 300),
    (6, 'Аренда с оплатой за неделю.', 1500),
    (6, 'Аренда с оплатой за месяц.', 4500),

    (7, 'Аренда с оплатой за час.', 50),
    (7, 'Аренда с оплатой за день.', 300),
    (7, 'Аренда с оплатой за неделю.', 1500),
    (7, 'Аренда с оплатой за месяц.', 4500),

    (8, 'Аренда с оплатой за час.', 100),
    (8, 'Аренда с оплатой за день.', 500),
    (8, 'Аренда с оплатой за неделю.', 2500),
    (8, 'Аренда с оплатой за месяц.', 8000),

    (9, 'Аренда с оплатой за час.', 100),
    (9, 'Аренда с оплатой за день.', 500),
    (9, 'Аренда с оплатой за неделю.', 2500),
    (9, 'Аренда с оплатой за месяц.', 8000),

    (10, 'Аренда с оплатой за час.', 100),
    (10, 'Аренда с оплатой за день.', 500),
    (10, 'Аренда с оплатой за неделю.', 2500),
    (10, 'Аренда с оплатой за месяц.', 8000);


-- insert client

-- Заполняем таблицу клиентов.

INSERT INTO client (
    first_name,
    last_name,
    phone
)
VALUES
    ('Карина', 'Белова', '+7 411 923 8377'),
    ('Георгий', 'Бурков', '+7 968 629 0989'),
    ('Владимир', 'Гришухин', '+7 911 203 3243'),
    ('Эдуард', 'Оленичев', '+7 919 891 2287'),
    ('Валентин', 'Ижевский', '+7 314 817 2874'),
    ('Линда', 'Васильева', '+7 455 124 2888');



-- insert rent_list

-- Когда заполнены основные таблицы оформим вещи в аренду.

INSERT INTO rent_list (
    client_id,
    item_id,
    rent_price_id,
    duration,
    rental_amount
)
VALUES
    (3, 8, 30, 2, 1000),
    (1, 4, 16, 3, 12000),
    (4, 1, 1, 3, 150),
    (2, 2, 7, 1, 1250);

И обновим информацию в таблице item в колонке  expires_at когда должна будет закончиться аренда.

UPDATE item SET expires_at = timestamp '2021-07-14 08:02:43.726234' WHERE id = 8;
UPDATE item SET expires_at = timestamp '2021-10-12 08:02:43.726234' WHERE id = 4;
UPDATE item SET expires_at = timestamp '2021-07-12 11:02:43.726234' WHERE id = 1;
UPDATE item SET expires_at = timestamp '2021-07-19 08:02:43.726234' WHERE id = 2;
